import { Injectable } from "@angular/core";
export interface City {
  id: number,
  city_ascii: string,
  lat: number,
  lng: number,
  point: any,
}
@Injectable({providedIn: 'root'})
export class MainService {
  city: City[] = [
    {
      id: 0,
      city_ascii: "Київ",
      lat: 50.4546600,
      lng: 30.5238000,
      point:
      [
        {
          id: 0,
          name: "Пам'ятник засновникам Києва ",
          lat: 50.429097,
          lng: 30.568911,
          url: "https://autotravel.ru/phalbum/90249/133.jpg",
          description: "Пам'ятник засновникам Києва спорудять в 1982 році. Автор пам'ятника Василь Бородай. Офіційна назва: пам'ятник ширяючого Либеді. ",
        },
        {
          id: 1,
          name: "Костел Святого Миколая ",
          lat: 50.4268987,
          lng: 30.5177478,
          url: "https://autotravel.ru/phalbum/90248/180.jpg",
          description: "Споруда костелу Св. Миколая почалася за конкурсним проектом архітектора С. В. Валовського в 1899 році. Розробка і будівництво будівлі проводилися під керівництвом відомого київського архітектора В. В. Городецького. Костел, збудований в стилізованих готичних формах з високими стрілчастими вежами і шпилями, відрізняється стрункими пропорціями, легкістю, ясністю композиційної структури.В даний час використовується як Будинок органної та камерної музики. ",
        },
        {
          id: 2,
          name: "Замок Річарда Левове Серце",
          lat: 50.4599541,
          lng: 30.5160138,
          url: "https://autotravel.ru/phalbum/90190/171.jpg",
          description: "Одне з найбільш знаменитих будівель Андріївського узвозу, та й усього Києва - замок Річарда. Цей будинок побудований в стилі англійської неоготики і нагадує середньовічний замок має воістину таємничу історію.Замок Річарда був побудований в 1902-1904 роки на замовлення київського промисловця Дмитра Орлова, який планував зробити з будівлі прибутковий будинок і здавати квартири в оренду. Однак в 1911 році Орлов зненацька помер - був застрелений, і його вдова продала будинок на аукціоні через борги, що накопичилися. ",
        },
        {
          id: 3,
          name: "Бессарабський ринок і вулиця Хрещатик ",
          lat: 50.4421077,
          lng: 30.5214986,
          url: "https://autotravel.ru/phalbum/91529/113.jpg",
          description: "Будинок побудований в 1910-1912 за проектом архітектора Генріха Гая на гроші відомого київського цукрозаводчика Лазаря Бродського, заповідані їм після смерті.Відкрито в 1912 році, працює за прямим призначенням, великий продуктовий ринок.Ринок примикає до великої пішохідної вулиці Хрещатик, одному з символів міста Києва. ",
        }
      ]
    },
    {
      id: 1,
      city_ascii: "Одеса",
      lat: 46.4775,
      lng: 30.7326,
      point:[
        {
          id: 0,
          name: "Потьомкінські сходи",
          lat: 46.29313,
          lng: 30.44518,
          url: "https://autotravel.ru/phalbum/90326/151-s.jpg",
          description: "Потьомкінські сходи вражає своїми розмірами - 192 сходинки, довжина 142 метри, висота 24 метри.Яcновельможний князь Воронцов подарував своїй дружині Єлизаветі сходи і коштувала вона місту 800 тис. Рублів. За радянських часів сходи були перейменовані в пам'ять повстання на броненосці «Потьомкін» в 1905 році (до революції називалася Рішельєвській - тому що у її початку стоїть пам'ятник графу (дюку) Де Рішельє - засновнику міста). Будівництво цієї гігантської сходів було розпочато в 1837 році і закінчено в 1841 році. Автором проекту був архітектор Ф. Боффо, який ретельно розробив пропорції споруди.",
        },
        {
          id: 1,
          name: "Пам'ятник Дюку Де Рішельє",
          lat: 46.29288,
          lng: 30.44473,
          url: "https://autotravel.ru/phalbum/90317/160.jpg",
          description: "Пам'ятник засновникові Одеси А.Е. Рішельє, що увінчує відому Потьомкінські сходи, 400 сходинок якої ведуть до Одеського морського порту. Герцог з привітанням простягає приїжджають руку і представляє на їх суд місто, який прожив не одне століття і бачила багато моментів історії.Пам'ятник закладений 30 червня 1827 р Одне з останніх творінь видатного російського скульптора І. П. Мартоса. Скульптура і горельєфи відлиті в бронзі ливарним майстром В. П. Єкімовим в Петербурзі. Постамент видатного петербурзького архітектора А. І. Мельникова і архітектора Ф. К. Боффо. Монумент в стилі класицизму, являє собою поставлену на п'єдестал бронзову статую А.Е. Рішельє. ",
        }
      ]

    }
  ]
}
